# Before you start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas
import numpy as np
import pandas as pd
from statsmodels.stats.weightstats import ztest
from scipy import stats
from scipy.stats import sem
import seaborn as sns
import matplotlib.pylab as plt

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents. Please, load the data using Ironhack's database (db: employees, table: employees_advanced).

In [2]:
# Your code here:
salaries = pd.read_csv('../data/Current_Employee_Names__Salaries__and_Position_Titles.csv')
salaries

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
...,...,...,...,...,...,...,...,...
33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
33182,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,115932.0,NaN

Examine the `salaries` dataset using the `head` function below.

In [3]:
# Your code here:

salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [4]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33183 entries, 0 to 33182
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               33183 non-null  object
 1   Job Titles         33183 non-null  object
 2   Department         33183 non-null  object
 3   Full or Part-Time  33183 non-null  object
 4   Salary or Hourly   33183 non-null  object
 5   Typical Hours      8022 non-null   float64
 6   Annual Salary      25161 non-null  float64
 7   Hourly Rate        8022 non-null   float64
dtypes: float64(3), object(5)
memory usage: 2.0+ MB

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [5]:
# Your code here:

salaries_annual = salaries[salaries['Salary or Hourly'] == 'Salary']
salaries_hourly = salaries[salaries['Salary or Hourly'] == 'Hourly']

In [6]:
columnas = ['Name', 'Job Titles','Department','Full or Part-Time','Salary or Hourly','Annual Salary']
salaries_annual = salaries_annual[columnas]
salaries_annual

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Annual Salary
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,101442.0
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,94122.0
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,101592.0
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,110064.0
5,"ABBASI, CHRISTOPHER",STAFF ASST TO THE ALDERMAN,CITY COUNCIL,F,Salary,50436.0
...,...,...,...,...,...,...
33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,72510.0
33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,48078.0
33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,90024.0
33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,93354.0
33182,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,115932.0

In [7]:
# Annual Salary
salaries_annual.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Annual Salary
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,101442.0
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,94122.0
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,101592.0
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,110064.0
5,"ABBASI, CHRISTOPHER",STAFF ASST TO THE ALDERMAN,CITY COUNCIL,F,Salary,50436.0

In [8]:
# Hourly Rate
salaries_hourly.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
6,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,46.10
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
10,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,2.65
18,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,17.68

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [9]:
# Your code here:
salaries.groupby('Department').count()['Name']

Department
ADMIN HEARNG                39
ANIMAL CONTRL               81
AVIATION                  1629
BOARD OF ELECTION          107
BOARD OF ETHICS              8
BUDGET & MGMT               46
BUILDINGS                  269
BUSINESS AFFAIRS           171
CITY CLERK                  84
CITY COUNCIL               411
COMMUNITY DEVELOPMENT      207
COPA                       116
CULTURAL AFFAIRS            65
DISABILITIES                28
DoIT                        99
FAMILY & SUPPORT           615
FINANCE                    560
FIRE                      4641
GENERAL SERVICES           980
HEALTH                     488
HUMAN RELATIONS             16
HUMAN RESOURCES             79
INSPECTOR GEN               87
LAW                        407
LICENSE APPL COMM            1
MAYOR'S OFFICE              85
OEMC                      2102
POLICE                   13414
POLICE BOARD                 2
PROCUREMENT                 92
PUBLIC LIBRARY            1015
STREETS & SAN             2198
TRANSPORTN                1140
TREASURER                   22
WATER MGMNT               1879
Name: Name, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [10]:
# Your code here:

# HO: u == 30$/h
# H1: u != 30$/h
# alpha = 1 - 0.95 = 0.05

In [11]:
hypothesis_mean = 30
sample_mean = salaries_hourly['Hourly Rate'].mean()
print(sample_mean)

32.78855771628024

In [12]:
alpha = 0.05

In [13]:
# ztest = (hypothesis_mean - sample_mean) / sample_std
zscore, pvalue = ztest(salaries_hourly['Hourly Rate'], value=hypothesis_mean)
zscore

20.6198057854942

In [14]:
pvalue

1.8228873859286195e-94

In [15]:
pvalue < alpha

True

Rechazo la hipotesis nula y **acepto** que la media es diferente, siendo mayor a $30 por hora

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [16]:
salaries_annual

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Annual Salary
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,101442.0
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,94122.0
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,101592.0
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,110064.0
5,"ABBASI, CHRISTOPHER",STAFF ASST TO THE ALDERMAN,CITY COUNCIL,F,Salary,50436.0
...,...,...,...,...,...,...
33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,72510.0
33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,48078.0
33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,90024.0
33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,93354.0
33182,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,115932.0

In [17]:
# Your code here:

# Ho: u <= $86000/year
# H1: u > $86000/year
hypothesis_mean = 86000
police_salaries = salaries_annual[salaries_annual['Department'] == 'POLICE']
police_salaries
sample_mean = police_salaries['Annual Salary'].mean()
sample_mean

86486.41450313339

In [18]:
zscore, pvalue = ztest(police_salaries['Annual Salary'], value=hypothesis_mean)
zscore

3.081997005712994

In [19]:
pvalue

0.002056169057509571

In [20]:
pvalue < alpha

True

Rechazo la hipotesis nula y **acepto** la media que es mayor a $86000 por año

Using the `crosstab` function, find the department that has the most hourly workers.

In [21]:
# Your code here:
salaries_hourly.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
6,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,46.10
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
10,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,2.65
18,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,17.68

In [22]:
hourly_workers = pd.crosstab(index=salaries_hourly['Department'], columns=salaries_hourly['Hourly Rate'], values=salaries_hourly['Hourly Rate'], aggfunc='sum').sum(axis=1).sort_values(ascending=False)
hourly_workers

Department
WATER MGMNT              63816.37
STREETS & SAN            62802.24
AVIATION                 38555.89
GENERAL SERVICES         31958.26
TRANSPORTN               30125.28
OEMC                     24780.68
PUBLIC LIBRARY            4967.07
FAMILY & SUPPORT          1534.21
FINANCE                   1412.00
CITY COUNCIL               967.23
LAW                        611.57
ANIMAL CONTRL              470.82
HEALTH                     245.86
MAYOR'S OFFICE             160.00
COMMUNITY DEVELOPMENT      121.21
BUSINESS AFFAIRS            96.38
POLICE                      93.84
CULTURAL AFFAIRS            83.00
PROCUREMENT                 81.50
FIRE                        80.40
HUMAN RESOURCES             40.00
BUDGET & MGMT               26.00
dtype: float64

**Water Management** is the most working hourly department

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [23]:
from scipy.stats import ttest_1samp

In [24]:
# Your code here:

# Ho: u >= $35/hour
# H1: u < $35/hour
hypothesis_mean = 35
water_mgmt_salaries = salaries_hourly[salaries_hourly['Department'] == 'WATER MGMNT'].reset_index(drop=True)
water_mgmt_salaries = water_mgmt_salaries.drop(columns='Annual Salary')
water_mgmt_salaries

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Hourly Rate
0,"ABRAMS, TIFFANY",OPERATING ENGINEER-GROUP C,WATER MGMNT,F,Hourly,40.0,45.07
1,"ABREU, DILAN",SEWER BRICKLAYER,WATER MGMNT,F,Hourly,40.0,44.88
2,"ABUHASHISH, AWWAD",PLUMBER,WATER MGMNT,F,Hourly,40.0,48.25
3,"ACOSTA, CESAR I",STEAMFITTER,WATER MGMNT,F,Hourly,40.0,47.50
4,"ADEWOLE, KAREEM A",CONSTRUCTION LABORER,WATER MGMNT,F,Hourly,40.0,40.20
...,...,...,...,...,...,...,...
1508,"ZIVAT, MICHAEL",CONSTRUCTION LABORER,WATER MGMNT,F,Hourly,40.0,40.20
1509,"ZIZUMBO, DANIEL",POOL MOTOR TRUCK DRIVER,WATER MGMNT,F,Hourly,40.0,35.60
1510,"ZUBECK, JOHN",PLUMBER,WATER MGMNT,F,Hourly,40.0,48.25
1511,"ZUNO, ERIK",CONSTRUCTION LABORER,WATER MGMNT,F,Hourly,40.0,40.20
1512,"ZWARYCZ, THOMAS J",POOL MOTOR TRUCK DRIVER,WATER MGMNT,F,Hourly,40.0,35.60

In [25]:
water_mgmt_salaries['Typical Hours'].value_counts()

Typical Hours
40.0    1513
Name: count, dtype: int64

In [26]:
water_mgmt_salaries['Hourly Rate'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 1513 entries, 0 to 1512
Series name: Hourly Rate
Non-Null Count  Dtype
--------------  -----
1513 non-null   float64
dtypes: float64(1)
memory usage: 11.9 KB

In [27]:
sample_mean = water_mgmt_salaries['Hourly Rate'].mean()
sample_mean

42.17869795109055

In [28]:
t_statistic, p_value = stats.ttest_1samp(water_mgmt_salaries['Hourly Rate'], hypothesis_mean)

In [29]:
t_statistic

43.413059315519625

In [30]:
p_value

5.038427302583611e-268

In [31]:
pvalue < alpha

True

Rechazo la hipotesis nula y **acepto** que la media que es menor a $35 por hora

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [32]:
salaries_hourly = salaries_hourly.drop(columns='Annual Salary')
salaries_hourly.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Hourly Rate
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,19.86
6,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,46.10
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,35.60
10,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,2.65
18,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,17.68

In [33]:
# Your code here

ddof = len(salaries_hourly['Hourly Rate']) - 1

hourly_rate_sem = stats.sem(salaries_hourly['Hourly Rate'], axis=None, ddof=ddof)
hourly_rate_mean = salaries_hourly['Hourly Rate'].mean()

print(ddof)
print(hourly_rate_sem)
print(hourly_rate_mean)

8021
12.111817701093825
32.78855771628024

In [34]:
# Hourly rate confidence interval
from scipy.stats import t
stats.t.interval(0.95, df=ddof, loc=hourly_rate_mean, scale=hourly_rate_sem)

(9.046248541993936, 56.53086689056654)

In [35]:
# Your comments here
'''
En cuando a la tasa por hora, hay un 95% de seguridad que su media se encuentre en el rango entre $9 y $56
'''

'\nEn cuando a la tasa por hora, hay un 95% de seguridad que su media se encuentre en el rango entre $9 y $56\n'

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [36]:
# Your code here:
police_salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Annual Salary
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,101442.0
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,94122.0
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,93354.0
11,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,F,Salary,84054.0
12,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,F,Salary,87006.0

In [37]:
ddof = len(police_salaries['Annual Salary']) - 1

police_salaries_sem = stats.sem(police_salaries['Annual Salary'], axis=None, ddof=ddof)
police_salaries_mean = police_salaries['Annual Salary'].mean()

print(ddof)
print(police_salaries_sem)
print(police_salaries_mean)

13403
18271.54668517837
86486.41450313339

In [38]:
stats.t.interval(0.95, df=ddof, loc=police_salaries_mean, scale=police_salaries_sem)

(50671.60678895816, 122301.22221730862)

In [39]:
# Your comments here
'''
En cuando al salario de los policias, hay un 95% de seguridad que 
su media se encuentre en el rango entre $50671 y $122301
'''

'\nEn cuando al salario de los policias, hay un 95% de seguridad que \nsu media se encuentre en el rango entre $50671 y $122301\n'

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [40]:
# Your code here: (https://www.statsmodels.org/stable/generated/statsmodels.stats.proportion.proportions_ztest.html)

from statsmodels.stats.proportion import proportions_ztest
salaries = pd.read_csv('../data/Current_Employee_Names__Salaries__and_Position_Titles.csv')
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

In [41]:
total_workers = len(salaries['Name'])
total_workers

33183

In [42]:
hourly_workers = len(salaries[salaries['Salary or Hourly'] == 'Hourly'])
hourly_workers

8022

In [43]:
# Ho: u == 25%
# H1: u != 25%
null_h = 0.25

In [44]:
# p: Proportion
# x: Number in the sample of study (hourly_workers)
# n: Size of the sample (total of dataframe)

p = hourly_workers / total_workers
p

0.24175029382515142

In [45]:
z_stat, p_value = proportions_ztest(hourly_workers, total_workers, null_h)

In [46]:
z_stat # Left side due to negative return

-3.5099964213703005

In [47]:
p_value

0.0004481127249057967

In [48]:
pvalue < alpha

True

In [49]:
# Your comments here
'''
El p-value sugiere que rechaze la hipotesis nula, lo que significa una proporción menor al 25% de trabajadores que
cobran por hora dentro del tamaño de la muestra (Dataframe salaries).
'''

'\nEl p-value sugiere que rechaze la hipotesis nula, lo que significa una proporción menor al 25% de trabajadores que\ncobran por hora dentro del tamaño de la muestra (Dataframe salaries).\n'